// Вычислить значение формулы ,где a, b, c, d — некоторые целые числа.
// Результат вывести на экран.

int a = 5;
int b = 7;
double c = 3;
double d = 8;

double quotient = (a * b)/(c + d);

Console.WriteLine(quotient);

